app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
   @productos = Product.all

INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "televisor"], ["price", 200000000.0], ["created_at", "2017-08-24 16:00:45.442372"], ["updated_at", "2017-08-24 16:00:45.442372"]]
---
def create
  @producto = Product.new(product_params)
  if @producto.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def edit
  @producto = Product.find(params[:id])