app/views/products/edit.html.erb

SELECT "categories".* FROM "categories"
---
      </div>
      <%= f.collection_check_boxes :category_ids, Category.all, :id, :name  do |c| %>