app/views/products/index.html.erb

SELECT "categories"."name" FROM "categories" INNER JOIN "categories_products" ON "categories"."id" = "categories_products"."category_id" WHERE "categories_products"."product_id" = ?  [["product_id", 1]]
---
            <td><%=  number_to_currency(producto.price, precision: 2)%></td>
            <td><%= producto.categories.pluck(:name).join(",") %></td>