app/views/products/new.html.erb

      </div>
      <%= f.collection_check_boxes :category_ids, Category.all, :id, :name  do |c| %>
---
SELECT "categories".* FROM "categories"